<?php

return [
    // identity
    'booking_mode' => [
        'services' => [
            'label' => 'Услуги',
            'description' => 'Парикмахерские салоны, консультации, массаж ...'
        ],
        'properties' => [
            'label' => 'Недвижимость',
            'description' => 'Апартаменты, дома для отдыха, краткосрочное проживание ...'
        ],
        'parking' => [
            'label' => 'Парковка',
            'description' => 'Парковка в аэропортах, частные парковочные места ...'
        ],
        'boat_rental' => [
            'label' => 'Аренда лодок',
            'description' => 'Лодки, яхты, водный транспорт ...'
        ],
        'car_rental' => [
            'label' => 'Аренда автомобилей',
            'description' => 'Автомобили, фургоны, автомобили класса люкс ...'
        ],
        'caravan_rental' => [
            'label' => 'Аренда автодомов',
            'description' => 'Караваны, кемперы, автодома ...'
        ],
    ],

    // properties
    'rental_type' => [
        'short_term' => [
            'label' => 'Краткосрочная аренда',
            'description' => 'Проживание на ночь или на неделю — дома для отдыха, квартиры, комнаты…',
        ],
        'long_term' => [
            'label' => 'Долгосрочная аренда',
            'description' => 'Ежемесячные договоры аренды — квартиры, гаражи, парковочные места…',
        ],
    ],
    'property_type' => [
        'apartment' => ['label' => 'Квартира'],
        'house'     => ['label' => 'Дом'],
        'room'      => ['label' => 'Комната'],
        'garage'    => ['label' => 'Гараж'],
        'garden'    => ['label' => 'Сад'],
        'parking'   => ['label' => 'Парковочное место'],
        'other'     => ['label' => 'Другое'],
    ],
];
